In [88]:
"""
скрипт для добавления колонок с абсолютной и относительной разницей
"""

'\nскрипт для добавления колонок с абсолютной и относительной разницей\n'

In [89]:
import pandas as pd
import numpy as np

In [90]:
def abs_diff(first_value,second_value):
    """
    Функция для подсчета абсолютной разницы между 2 значениями
    """
    try:
        return float(first_value) - float(second_value)
    except:
        return None

In [91]:
def percent_diff(first_value,second_value):
    """
    функция для подсчета относительной разницы значений
    """
    try:
        # округляем до трех
        value = round(float(second_value) / float(first_value),4) * 100
        return value
    except:
        return None

In [92]:
df1 = pd.read_excel('data/Сложный вариант таблицы №1.xlsx',dtype=str)
df2 = pd.read_excel('data/Сложный вариант таблицы №96.xlsx',dtype=str)

In [93]:
df_cols = df1.compare(df2,result_names=('Первая таблица','Вторая таблица')) # датафрейм с разницей по колонкам
df_cols.index = list(map(lambda x: x + 2, df_cols.index)) # добавляем к индексу +2 чтобы соответствовать нумерации в экселе
df_cols.index.name = '№ строки' # переименовываем индекс

df_rows = df1.compare(df2, align_axis=0, result_names=('Первая таблица', 'Вторая таблица')) # датафрейм с разницей по строкам
lst_mul_ind = list(map(lambda x: (x[0] + 2, x[1]), df_rows.index)) # добавляем к индексу +2 чтобы соответствовать нумерации в экселе
index = pd.MultiIndex.from_tuples(lst_mul_ind, names=['№ строки', 'Таблица']) # создаем мультиндекс
df_rows.index = index

In [94]:
df_cols

         Амурская область                Воронежская область                 \
           Первая таблица Вторая таблица      Первая таблица Вторая таблица
№ строки
4                   12026          11000                 NaN            NaN
6                     NaN            NaN                1449          523.5
22                    NaN            NaN                 NaN            NaN

            Unnamed: 41
         Первая таблица Вторая таблица
№ строки
4                   NaN            NaN
6                   NaN            NaN
22                 2373            NaN

In [95]:
#df_cols['new'] = df_cols.apply(lambda x:abs_diff(x['Амурская область']['Первая таблица'],x['Амурская область']['Вторая таблица']),axis=1)

In [96]:
df_cols['new'] = df_cols.apply(lambda x:abs_diff(x['Воронежская область']['Первая таблица'],x['Воронежская область']['Вторая таблица']),axis=1)

In [97]:
df_cols

         Амурская область                Воронежская область                 \
           Первая таблица Вторая таблица      Первая таблица Вторая таблица
№ строки
4                   12026          11000                 NaN            NaN
6                     NaN            NaN                1449          523.5
22                    NaN            NaN                 NaN            NaN

            Unnamed: 41                   new
         Первая таблица Вторая таблица
№ строки
4                   NaN            NaN    NaN
6                   NaN            NaN  925.5
22                 2373            NaN    NaN

In [98]:
df_cols['second'] = df_cols.apply(lambda x:percent_diff(x['Воронежская область']['Первая таблица'],x['Воронежская область']['Вторая таблица']),axis=1)

In [99]:
df_cols

         Амурская область                Воронежская область                 \
           Первая таблица Вторая таблица      Первая таблица Вторая таблица
№ строки
4                   12026          11000                 NaN            NaN
6                     NaN            NaN                1449          523.5
22                    NaN            NaN                 NaN            NaN

            Unnamed: 41                   new second
         Первая таблица Вторая таблица
№ строки
4                   NaN            NaN    NaN    NaN
6                   NaN            NaN  925.5  36.13
22                 2373            NaN    NaN    NaN

In [100]:
df_cols.to_excel('gdf.xlsx')